brew 'mas'
mas 'Xcode', id: 497799835
mas 'Wunderlist', id: 410628904
mas 'Todoist', id: 585829637
:update

# Todoist cli: https://github.com/sachaos/todoist
tap 'sachaos/todoist'
brew 'todoist'

tap 'caskroom/versions'
tap 'caskroom/fonts'

tap 'spotify/sptaps', 'git@ghe.spotify.net:shared/homebrew-spotify.git'
brew 'spotify/sptaps/hmtools'
brew 'styx-cli'
brew 'hades-cli'

tap 'spotify/public'
brew 'scio'

tap 'buo/cask-upgrade'
cask 'font-hasklig'
cask 'font-hack'
cask 'font-source-code-pro'

cask 'caskroom/versions/java6'
cask 'java8'
cask 'java'
tap 'pivotal/tap'
brew 'springboot'

tap 'cloudfoundry/tap'
brew 'springboot'
brew 'spring-completion'

brew 'ant'
brew 'aws-shell'
brew 'bash'
brew 'clojure'
brew 'coreutils'
brew 'ctags'
brew 'curl'
brew 'docker'
brew 'docker-machine'
brew 'docker-machine-driver-xhyve'
brew 'elasticsearch'
brew 'erlang'
brew 'ffmpeg'
brew 'findutils'
brew 'gcc'
brew 'git'
brew 'gradle'
brew 'groovy'
brew 'htop'
brew 'hub'
brew 'ipcalc'
brew 'jenv'
brew 'jq'
brew 'kotlin'
brew 'kubernetes-cli'
brew 'lastpass-cli'
brew 'leiningen'
brew 'lua'
brew 'luajit'
brew 'macvim', args: ["--custom-icons", "--with-override-system-vim", "--with-lua", "--with-luajit"]
brew 'maven'
brew 'minicom'
brew 'netcat'
brew 'neovim'
brew 'nexus', restart_service: true
brew 'node'
brew 'openconnect'
#brew 'openssh'
brew 'openssl'
brew 'peco'
brew 'postgresql'
brew 'rabbitmq', restart_service: :changed
brew 'reattach-to-user-namespace'
brew 'rename'
brew 'rsync'
brew 'ruby'
brew 'rbenv'
brew 'ruby-build'
brew 'rtv'
brew 'rustup-init'
brew 'sbt'
brew 'scala'
brew 'screen'
brew 'ssh-copy-id'
brew 'sshrc'
brew 'terraform'
brew 'the_silver_searcher'
brew 'tig'
brew 'tmux'
brew 'tmuxinator-completion'
brew 'unrar'
brew 'vim'
brew 'watch'
brew 'weechat'
brew 'wget'
brew 'yarn'
brew 'zsh'
cask 'Hammerspoon'
cask 'Wavebox'
cask 'aerial'
cask 'airdroid'
cask 'calibre'
cask 'deluge'
cask 'dropbox'
cask 'firefox'
cask 'gitter'
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'iterm2'
cask 'jetbrains-toolbox'
cask 'keybase'
cask 'keepassx'
cask 'lastpass'
cask 'licecap'
cask 'minikube'
cask 'little-snitch'
cask 'plex-media-player'
cask 'skitch'
cask 'skype'
cask 'spotify'
cask 'tunnelblick'
#cask 'vagrant'
cask 'viber'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'visualvm'
cask 'vlc'
