:update

# Todoist cli: https://github.com/sachaos/todoist
tap 'sachaos/todoist'
brew 'todoist'

tap 'caskroom/versions'
tap 'caskroom/fonts'

tap 'buo/cask-upgrade'
cask 'font-hasklig'
cask 'font-hack'
cask 'font-source-code-pro'

cask 'caskroom/versions/java6'
cask 'java8'
cask 'java'
tap 'pivotal/tap'
brew 'springboot'

tap 'cloudfoundry/tap'
brew 'springboot'
brew 'spring-completion'

brew 'ant'
brew 'avro-tools'
brew 'asciinema'
brew 'asciinema2gif'
brew 'aws-shell'
brew 'azure-cli'
brew 'bash'
brew 'clojure'
brew 'coreutils'
brew 'cfssl'
brew 'ctags'
brew 'cmake'
brew 'curl'
brew 'docker'
brew 'docker-machine'
brew 'docker-machine-driver-xhyve'
brew 'elasticsearch'
brew 'erlang'
brew 'ffmpeg'
brew 'flake8'
brew 'findutils'
brew 'gcc'
brew 'git'
brew 'gradle'
brew 'groovy'
brew 'htop'
brew 'hub'
brew 'ipcalc'
brew 'jenv'
brew 'jq'
brew 'kotlin'
brew 'kubernetes-cli'
brew 'lastpass-cli'
brew 'leiningen'
brew 'lua'
brew 'luajit'
brew 'macvim', args: ["--custom-icons", "--with-override-system-vim", "--with-lua", "--with-luajit"]
brew 'maven'
brew 'minicom'
brew 'netcat'
brew 'neovim'
brew 'nexus', restart_service: true
brew 'node'
brew 'nvm'
brew 'openconnect'
#brew 'openssh'
brew 'openssl'
brew 'peco'
brew 'postgresql'
brew 'pyenv'
brew 'rabbitmq', restart_service: :changed
brew 'reattach-to-user-namespace'
brew 'rename'
brew 'rsync'
brew 'ruby'
brew 'rbenv'
brew 'ripgrep'
brew 'ruby-build'
brew 'rtv'
brew 'rustup-init'
brew 'sbt'
brew 'scala'
brew 'screen'
brew 'ssh-copy-id'
brew 'sshrc'
brew 'swig'
brew 'terraform'
brew 'the_silver_searcher'
brew 'tig'
brew 'tmux'
brew 'tmuxinator-completion'
brew 'unrar'
brew 'vim', args: [ "--with-override-system-vim", "--with-lua", "--with-luajit"]
brew 'watch'
brew 'weechat'
brew 'wget'
brew 'yarn'
brew 'zsh'

