:update

# Todoist cli: https://github.com/sachaos/todoist
tap 'sachaos/todoist'
brew 'todoist'

tap 'caskroom/versions'
tap 'caskroom/fonts'

brew 'heroku/brew/heroku'

tap 'typelead/eta'
brew 'etlas'

tap 'buo/cask-upgrade'
cask 'font-hasklig'
cask 'font-hack'
cask 'font-source-code-pro'

cask 'caskroom/versions/java6'
cask 'java8'
cask 'java'
tap 'pivotal/tap'

tap 'cloudfoundry/tap'
brew 'springboot'

brew 'agda'
brew 'ant'
brew 'asciinema'
brew 'asciinema2gif'
brew 'aws-shell'
brew 'azure-cli'
brew 'bash'
brew 'bat'
brew 'bind'
brew 'cfssl'
brew 'clojure'
brew 'cmake'
brew 'cookiecutter'
brew 'coreutils', args: ["--default-names"]
brew 'ctags'
brew 'curl'
brew 'dateutils'
brew 'docker'
brew 'docker-machine'
brew 'docker-machine-driver-hyperkit'
brew 'hyperkit'
brew 'elasticsearch'
brew 'entr'
brew 'erlang'
brew 'fasd'
brew 'fd'
brew 'ffmpeg'
brew 'findutils'
brew 'flake8'
brew 'gcc'
brew 'gcs-avro-tools'
brew 'gist'
brew 'git'
brew 'glib'
brew 'go'
brew 'gpg'
brew 'gradle'
brew 'groovy'
brew 'grpc'
brew 'htop'
brew 'hub'
brew 'idris'
brew 'imagemagick'
brew 'ipcalc'
brew 'jenv'
brew 'jq'
brew 'kotlin'
brew 'kubernetes-cli'
brew 'lastpass-cli'
brew 'leiningen'
brew 'lua'
brew 'luajit'
brew 'maven'
brew 'minicom'
brew 'neovim'
brew 'netcat'
brew 'nvm'
brew 'openconnect'
brew 'openssl'
brew 'peco'
brew 'postgresql'
brew 'protobuf'
brew 'prettyping'
brew 'pstree'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'rabbitmq', restart_service: :changed
brew 'rbenv'
brew 'reattach-to-user-namespace'
brew 'rename'
brew 'ripgrep'
brew 'rsync'
brew 'rtv'
brew 'ruby'
brew 'ruby-build'
brew 'rustup-init'
brew 'sbt'
brew 'scala'
brew 'screen'
brew 'socat'
brew 'ssh-copy-id'
brew 'sshfs'
brew 'sshrc'
brew 'swig'
brew 'task'
brew 'terraform'
brew 'the_silver_searcher'
brew 'tig'
brew 'tldr'
brew 'tmux'
brew 'tmuxinator-completion'
brew 'tree'
brew 'typescript'
brew 'unrar'
brew 'vim', args: [ "--with-override-system-vi", "--with-lua"]
brew 'vit'
brew 'watch'
brew 'weechat', args: ["--with-aspell", "--with-curl", "--with-python", "--with-perl", "--with-ruby", "--with-lua", "--with-guile"]
brew 'wget'
brew 'wrk'
brew 'yarn'
brew 'youtube-dl'
brew 'zaquestion/tap/lab'
brew 'zsh'
cask 'alacritty'
