evanlucas/fish-kubectl-completions
jorgebucaran/fish-nvm
lgathy/google-cloud-sdk-fish-completion
decors/fish-colored-man
decors/fish-homesick
decors/rbenv
reitzig/sdkman-for-fish
halostatue/fish-go
